package master.naucnacentrala.model.enums;

public enum NaucnaOblast {
    PRIRODNO_MATEMATICKE_NAUKE, TEHNICKO_TEHNOLOSKE_NAUKE, DRUSTVENO_HUMANISTICKE_NAUKE, MEDICINA, UMETNOST;

    //Научне, односно стручне области у оквиру образовно-научног поља Природноматематичких
    //наука су:
    //1. Биолошке науке;
    //2. Гео-науке;
    //3. Математичке науке;
    //4. Науке о заштити животне средине и заштити на раду;
    //5. Рачунарске науке;
    //6. Физичке науке;
    //7. Физичко-хемијске науке;
    //8. Хемијске науке.

    //Научне, односно стручне области у оквиру образовно-научног поља Техничкотехнолошких
    //наука су:
    //1. Архитектура;
    //2. Биотехничке науке;
    //3. Грађевинско инжењерство;
    //4. Геодетско инжењерство;
    //5. Електротехничко и рачунарско инжењерство;
    //6. Индустријско инжењерство и инжењерски менаџмент;
    //7. Инжењерство заштите животне средине;
    //8. Машинско инжењерство;
    //9. Организационе науке;
    //10. Рударско инжењерство;
    //11. Саобраћајно инжењерство;
    //12. Технолошко инжењерство;
    //13. Металуршко инжењерство.

    //Научне, односно стручне области у оквиру образовно-научног поља Друштвенохуманистичких
    //наука су:
    //1. Библиотекарство, архиварство и музеологија;
    //2. Економске науке;
    //3. Историјске и археолошке науке;
    //4. Културолошке науке и комуникологија;
    //5. Менаџмент и бизнис;
    //6. Педагошке науке;
    //7. Политичке науке;
    //8. Правне науке;
    //9. Психолошке науке;
    //10. Социолошке науке;
    //11. Специјална едукација и рехабилитација;
    //12. Теологија;
    //13. Физичко васпитање и спорт;
    //14. Филозофија;
    //15. Филолошке науке;
    //16.Науке о уметностима.

    //Научне, односно стручне области у оквиру образовно-научног поља
    //Медицинских наука су:
    //1. Ветеринарске науке;
    //2. Медицинске науке;
    //3. Стоматолошке науке;
    //4. Фармацеутске науке.
    //5.Рехабилитација.

    //Уметничке, односно стручне области у оквиру образовно-уметничког поља
    //Уметности су:
    //1. Драмске и аудиовизуелне уметности;
    //2. Ликовне уметности;
    //3. Музика и извођачке уметности;
    //4. Примењене уметности и дизајн.


    public static String normalized(NaucnaOblast naucnaOblast) {
        String retval = naucnaOblast.toString();
        retval = retval.replace('_', ' ');
        retval = retval.toLowerCase();
        return retval;
    }
}
